In [2]:
import pandas as pd

In [4]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("series \n",series)

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [8]:
data={
    'name':['omkar','john','jack'],
    'age':[22,25,29],
    'city':['banglore','newyork','florida']
}

df=pd.DataFrame(data)
print(df)

    name  age      city
0  omkar   22  banglore
1   john   25   newyork
2   jack   29   florida

In [9]:
import numpy as np
np.array(df)

array([['omkar', 22, 'banglore'],
       ['john', 25, 'newyork'],
       ['jack', 29, 'florida']], dtype=object)

In [16]:
data=[
    {'name':'omkar','age':22,'city':'banglore'},
    {'name':'krish','age':24,'city':'pune'},
    {'name':'atharva','age':26,'city':'mumbai'},
    {'name':'vishal','age':28,'city':'chennai'}

]
df=pd.DataFrame(data)
print(df)

      name  age      city
0    omkar   22  banglore
1    krish   24      pune
2  atharva   26    mumbai
3   vishal   28   chennai

In [17]:
df

      name  age      city
0    omkar   22  banglore
1    krish   24      pune
2  atharva   26    mumbai
3   vishal   28   chennai

In [18]:
df.at[1,'age']

np.int64(24)

In [19]:
df.head()

      name  age      city
0    omkar   22  banglore
1    krish   24      pune
2  atharva   26    mumbai
3   vishal   28   chennai

In [20]:
df.head(2)

    name  age      city
0  omkar   22  banglore
1  krish   24      pune

In [21]:
df.iat[2,2]

'mumbai'

In [24]:
df['salary']=[50000,60000,70000,80000]
df

      name  age      city  salary
0    omkar   22  banglore   50000
1    krish   24      pune   60000
2  atharva   26    mumbai   70000
3   vishal   28   chennai   80000

In [29]:
df.drop('salary',axis=1,inplace=True)

In [30]:
df

      name  age      city
0    omkar   22  banglore
1    krish   24      pune
2  atharva   26    mumbai
3   vishal   28   chennai

In [34]:
df['age']=df['age']+1
df

      name  age      city
0    omkar   26  banglore
1    krish   28      pune
2  atharva   30    mumbai
3   vishal   32   chennai

In [43]:
df.drop(1,inplace=True)

In [44]:
df

      name  age     city
2  atharva   30   mumbai
3   vishal   32  chennai